<?php

use Illuminate\Database\Seeder;

class ReferenceCodeSeeder extends Seeder
{
    protected $data = array(
		['id' =>1, 'code' =>'100', 'name' =>'наименование кода не указано'],
		['id' =>2, 'code' =>'101', 'name' =>'наименование кода не указано'],
		['id' =>3, 'code' =>'102', 'name' =>'наименование кода не указано'],
		['id' =>4, 'code' =>'103', 'name' =>'наименование кода не указано'],
		['id' =>5, 'code' =>'104', 'name' =>'наименование кода не указано'],
		['id' =>6, 'code' =>'105', 'name' =>'наименование кода не указано'],
		['id' =>7, 'code' =>'106', 'name' =>'наименование кода не указано'],
		['id' =>8, 'code' =>'108', 'name' =>'наименование кода не указано'],
		['id' =>9, 'code' =>'109', 'name' =>'наименование кода не указано'],
		['id' =>10, 'code' =>'110', 'name' =>'наименование кода не указано'],
		['id' =>11, 'code' =>'111', 'name' =>'наименование кода не указано'],
		['id' =>12, 'code' =>'112', 'name' =>'наименование кода не указано'],
		['id' =>13, 'code' =>'113', 'name' =>'наименование кода не указано'],
		['id' =>14, 'code' =>'114', 'name' =>'наименование кода не указано'],
		['id' =>15, 'code' =>'115', 'name' =>'наименование кода не указано'],
		['id' =>16, 'code' =>'117', 'name' =>'наименование кода не указано'],
		['id' =>17, 'code' =>'200', 'name' =>'наименование кода не указано'],
		['id' =>18, 'code' =>'201', 'name' =>'наименование кода не указано'],
		['id' =>19, 'code' =>'203', 'name' =>'наименование кода не указано'],
		['id' =>20, 'code' =>'204', 'name' =>'наименование кода не указано'],
		['id' =>21, 'code' =>'205', 'name' =>'наименование кода не указано'],
		['id' =>22, 'code' =>'207', 'name' =>'наименование кода не указано'],
		['id' =>23, 'code' =>'209', 'name' =>'наименование кода не указано'],
		['id' =>24, 'code' =>'210', 'name' =>'наименование кода не указано'],
		['id' =>25, 'code' =>'213', 'name' =>'наименование кода не указано'],
		['id' =>26, 'code' =>'300', 'name' =>'наименование кода не указано'],
		['id' =>27, 'code' =>'118', 'name' =>'наименование кода не указано'],
		['id' =>28, 'code' =>'119', 'name' =>'наименование кода не указано'],
		['id' =>29, 'code' =>'120', 'name' =>'наименование кода не указано'],
		['id' =>30, 'code' =>'121', 'name' =>'наименование кода не указано'],
		['id' =>31, 'code' =>'101.01', 'name' =>'наименование кода не указано'],
		['id' =>32, 'code' =>'101.02', 'name' =>'наименование кода не указано'],
		['id' =>33, 'code' =>'101.03', 'name' =>'наименование кода не указано'],
		['id' =>34, 'code' =>'101.04', 'name' =>'наименование кода не указано'],
		['id' =>35, 'code' =>'111.01', 'name' =>'наименование кода не указано'],
		['id' =>36, 'code' =>'112.01', 'name' =>'наименование кода не указано'],
		['id' =>37, 'code' =>'112.02', 'name' =>'наименование кода не указано'],
		['id' =>38, 'code' =>'112.03', 'name' =>'наименование кода не указано'],
		['id' =>39, 'code' =>'113.01', 'name' =>'наименование кода не указано'],
		['id' =>40, 'code' =>'113.02', 'name' =>'наименование кода не указано'],
		['id' =>41, 'code' =>'113.03', 'name' =>'наименование кода не указано'],
		['id' =>42, 'code' =>'113.04', 'name' =>'наименование кода не указано'],
		['id' =>43, 'code' =>'113.09', 'name' =>'наименование кода не указано'],
		['id' =>44, 'code' =>'113.10', 'name' =>'наименование кода не указано'],
		['id' =>45, 'code' =>'113.11', 'name' =>'наименование кода не указано'],
		['id' =>46, 'code' =>'113.12', 'name' =>'наименование кода не указано'],
		['id' =>47, 'code' =>'113.14', 'name' =>'наименование кода не указано'],
		['id' =>48, 'code' =>'113.15', 'name' =>'наименование кода не указано'],
		['id' =>49, 'code' =>'113.16', 'name' =>'наименование кода не указано'],
		['id' =>50, 'code' =>'113.18', 'name' =>'наименование кода не указано'],
		['id' =>51, 'code' =>'113.20', 'name' =>'наименование кода не указано'],
		['id' =>52, 'code' =>'113.21', 'name' =>'наименование кода не указано'],
		['id' =>53, 'code' =>'113.22', 'name' =>'наименование кода не указано'],
		['id' =>54, 'code' =>'113.23', 'name' =>'наименование кода не указано'],
		['id' =>55, 'code' =>'113.24', 'name' =>'наименование кода не указано'],
		['id' =>56, 'code' =>'117.01', 'name' =>'наименование кода не указано'],
		['id' =>57, 'code' =>'112.04', 'name' =>'наименование кода не указано'],
		['id' =>58, 'code' =>'108.1', 'name' =>'наименование кода не указано'],
		['id' =>59, 'code' =>'110.1', 'name' =>'наименование кода не указано'],
		['id' =>62, 'code' =>'113.6', 'name' =>'наименование кода не указано'],
		['id' =>63, 'code' =>'113.7', 'name' =>'наименование кода не указано'],
		['id' =>66, 'code' =>'113.13', 'name' =>'наименование кода не указано'],
		['id' =>67, 'code' =>'113.17', 'name' =>'наименование кода не указано'],
		['id' =>68, 'code' =>'113.19', 'name' =>'наименование кода не указано'],
		['id' =>69, 'code' =>'122', 'name' =>'наименование кода не указано'],
		['id' =>70, 'code' =>'123', 'name' =>'наименование кода не указано'],
		['id' =>71, 'code' =>'200.1', 'name' =>'наименование кода не указано'],
		['id' =>72, 'code' =>'113.5', 'name' =>'наименование кода не указано'],
		['id' =>73, 'code' =>'113.8', 'name' =>'наименование кода не указано'],
		['id' =>74, 'code' =>'124', 'name' =>'наименование кода не указано'],
		['id' =>75, 'code' =>'106.1', 'name' =>'наименование кода не указано'],
		['id' =>76, 'code' =>'106.2', 'name' =>'наименование кода не указано'],
		['id' =>77, 'code' =>'107', 'name' =>'наименование кода не указано'],
		['id' =>78, 'code' =>'107.1', 'name' =>'наименование кода не указано'],
		['id' =>79, 'code' =>'107.2', 'name' =>'наименование кода не указано'],
		['id' =>80, 'code' =>'108.2', 'name' =>'наименование кода не указано'],
		['id' =>81, 'code' =>'108.3', 'name' =>'наименование кода не указано'],
		['id' =>82, 'code' =>'109.1', 'name' =>'наименование кода не указано'],
		['id' =>83, 'code' =>'109.2', 'name' =>'наименование кода не указано'],
		['id' =>84, 'code' =>'109.3', 'name' =>'наименование кода не указано'],
		['id' =>85, 'code' =>'109.4', 'name' =>'наименование кода не указано'],
		['id' =>86, 'code' =>'110.2', 'name' =>'наименование кода не указано'],
		['id' =>87, 'code' =>'111.1', 'name' =>'наименование кода не указано'],
		['id' =>88, 'code' =>'111.2', 'name' =>'наименование кода не указано'],
		['id' =>89, 'code' =>'115', 'name' =>'наименование кода не указано'],
		['id' =>90, 'code' =>'116', 'name' =>'наименование кода не указано'],
		['id' =>91, 'code' =>'200.2', 'name' =>'наименование кода не указано'],
		['id' =>92, 'code' =>'200.3', 'name' =>'наименование кода не указано'],
		['id' =>93, 'code' =>'110.3', 'name' =>'наименование кода не указано'],
		['id' =>94, 'code' =>'102.1', 'name' =>'наименование кода не указано'],
		['id' =>95, 'code' =>'102.2.', 'name' =>'наименование кода не указано'],
		['id' =>96, 'code' =>'102.3', 'name' =>'наименование кода не указано'],
		['id' =>97, 'code' =>'112.5', 'name' =>'наименование кода не указано'],
	);

	/**
	* Run the database seeds.
	*
	* @return void
	*/
	public function run()
	{
		$this->seedingTable('code', $this->data);
	}

	public function seedingTable($table, $items)
	{
		foreach ($items as $item) {
			DB::table($table)->insert(['id' => $item['id'], 'code' => $item['code'], 'name' => $item['name']]);
		}
	}
}
